@nickfloyd - related to the comment above (https://github.com/integrations/terraform-provider-github/issues/2954#issuecomment-3603266379). We are seeing another repo now considered by the provider to be deleted, same symptoms as the OP. 

The question is why the provider updates these at seemingly random times? I would assume that in one plan all repos that are marked as forks would be destroyed. but we are seeing it happen one repo every other day. any idea what is going on?

here is the plan from today:

```
Terraform planned the following actions, but then encountered a problem:

  # github_repository.github_repository["cancel-workflow-action"] must be replaced
-/+ resource "github_repository" "github_repository" {
      - auto_init                   = false -> null
      ~ default_branch              = "main" -> (known after apply)
      ~ etag                        = "W/\"cbcef5b7bf01a773ebc13bdf0d0037fd0000fa71b95dc5e9a60f58942a43d15b\"" -> (known after apply)
      - fork                        = true -> null # forces replacement
      ~ full_name                   = "thebrowsercompany/cancel-workflow-action" -> (known after apply)
      ~ git_clone_url               = "git://github.com/thebrowsercompany/cancel-workflow-action.git" -> (known after apply)
      - has_discussions             = false -> null
      ~ html_url                    = "https://github.com/thebrowsercompany/cancel-workflow-action" -> (known after apply)
      ~ http_clone_url              = "https://github.com/thebrowsercompany/cancel-workflow-action.git" -> (known after apply)
      ~ id                          = "cancel-workflow-action" -> (known after apply)
      - is_template                 = false -> null
        name                        = "cancel-workflow-action"
      ~ node_id                     = "MDEwOlJlcG9zaXRvcnkzNDQwOTE1MjU=" -> (known after apply)
      + primary_language            = (known after apply)
      ~ private                     = false -> (known after apply)
      ~ repo_id                     = 344091525 -> (known after apply)
      - source_owner                = "pgalisz" -> null # forces replacement
      - source_repo                 = "cancel-workflow-action" -> null # forces replacement
      ~ ssh_clone_url               = "git@github.com:thebrowsercompany/cancel-workflow-action.git" -> (known after apply)
      ~ svn_url                     = "https://github.com/thebrowsercompany/cancel-workflow-action" -> (known after apply)
      ~ topics                      = [] -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ security_and_analysis (known after apply)
      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Error: Instance cannot be destroyed

  on github-repos.tf line 252:
 252: resource "github_repository" "github_repository" {
```